---
kind: method
id: M:Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.GetNonContinuousRail(System.Int32)
source: html/813921fb-3f6c-9db9-a4df-1ddc3dc55fa7.htm
---
# Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.GetNonContinuousRail Method

Gets the Non-Continuous Rail object of specified index from the Rail Structure.

## Syntax (C#)
```csharp
public NonContinuousRailInfo GetNonContinuousRail(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - Non-Continuous Rail index.

## Returns
The requested object handle.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - The index index is out of range.